#!/bin/bash
source "../conf/bash_conf.sh"
RUN_CUR_PATH=`pwd`
############################
##get run_time
############################
echo "RUN_DAY="${RUN_DAY}

###########################
##get param for stat
##########################
CUR_RUN_TIME=${RUN_DAY}

#################################################
#####获取用户PC端浏览
#####RUN_MONTH_START:数据开始月份
#####RUN_MONTH_END:数据截止月份
#####CITY_ID:数据城市
###############################################
sh -x "${BIN_PATH}/extract_pc.sh" ${CUR_RUN_TIME}

#################################################
#####获取用户MOBILE端浏览
#####RUN_MONTH_START:数据开始月份
#####RUN_MONTH_END:数据截止月份
#####CITY_ID:数据城市
###############################################
sh -x "${BIN_PATH}/extract_mobile.sh" ${CUR_RUN_TIME}

#################################################
#####用户线上uuid与ucid映射
###############################################
sh -x "${BIN_PATH}/uuid_2_ucid.sh" ${CUR_RUN_TIME}

#################################################
#####生成用户json文件
#####START_DATE:数据开始月份
#####END_DATE:数据截止月份
###############################################
sh -x "${BIN_PATH}/user_json.sh" ${CUR_RUN_TIME}

#################################################
#####用户特征生成
###############################################
sh -x "${BIN_PATH}/user_feature.sh" ${CUR_RUN_TIME}

#################################################
#####用户topN小区特征
#####TOPN:排名前N个小区
###############################################
sh -x "${BIN_PATH}/user_resblock_top.sh" ${CUR_RUN_TIME}

#################################################
#####用户委托前15日浏览,关注量
#####DAY_DISTANCE:距离委托前N天
###############################################
sh -x "${BIN_PATH}/feature_before_del.sh" ${CUR_RUN_TIME}

